In [1]:
import pandas as pd
import sqlite3

conn = sqlite3.connect("test_db.db")

In [ ]:
if conn:
    dataset = pd.read_sql(
    """SELECT 
        s.id AS sale_id,
        s.db_amount AS total_sale,
        s.db_date AS date,
        s.db_hour AS time,
        s.db_payment_method AS payment_method,
        p.id AS product_id,
        p.db_product_name AS product_name,
        sd.db_quantity AS quantity,
        sd.db_unit_price AS unit_price,
        sd.db_subtotal AS subtotal
    FROM sales s
    JOIN sales_details sd ON s.id = sd.db_sale_id
    JOIN inventory_stock p ON sd.db_product_id = p.id
    WHERE s.id = 48 ;""",  # Modify the id as you want
    conn)
dataset.to_csv('database.csv', index=False)

In [3]:
database = 'database.csv'
df = pd.read_csv(database)
df.head(5)

,sale_id,total_sale,date,time,payment_method,product_id,product_name,quantity,unit_price,subtotal
0,48,13955.43,2025-05-04,19:00:59.000000,Efectivo,1,COCA COLA SABOR ORIGINAL 2.25L,3,3851.81,11555.43
1,48,13955.43,2025-05-04,19:00:59.000000,Efectivo,3,EDULCORANTE HILERET CLASICO,2,1200.00,2400.00

In [6]:
if conn:
    dataset2 = pd.read_sql(
    """SELECT * FROM sales order by id DESC""", conn)
    
dataset2.to_csv('query.csv', index=False)
query = 'query.csv'
df = pd.read_csv(query)
df.head(5)

,id,db_purchased_quantity,db_amount,db_payment_method,db_date,db_hour
0,55,6,18155.43,Transferencia,2025-05-04,22:32:32.000000
1,54,10,30259.05,Efectivo,2025-05-04,22:24:02.000000
2,53,6,18155.43,Transferencia,2025-05-04,22:23:42.000000
3,52,7,20355.43,Transferencia,2025-05-04,22:23:21.000000
4,51,2,6051.81,Efectivo,2025-05-04,21:50:24.000000